---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarCoupler
source: html/9e0b4aa3-a89c-57a8-8d10-c03b57f6321d.htm
---
# RebarCoupler Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.